
#ПРОЕКТ ПО ПРЕДМЕТОТ БИЗНИС СТАТИСТИКА
#ТЕА МИНОВА
#ИНДЕКС БР. 213004


#ИНСТАЛАЦИЈА НА ПАКЕТИ
#Листа на неопходни пакети
my_packages <- c("data.table", 
                 "ggplot2", 
                 "distributions3", 
                 "BSDA", 
                 "pivottabler"
                )
#Проверка и автоматска инсталација на пакетите кои недостасуваат
not_installed <- my_packages[!(my_packages %in% installed.packages()[ , "Package"])]
if(length(not_installed)) install.packages(not_installed)

#Импортирање на базата на податоци
RAW_DF = read.csv('C:/Users/Tea/Desktop/Statistika/car_data.csv')

#Преименување на долгите имиња на некои колони
names(RAW_DF)[names(RAW_DF) == "Kilometers.Driven"] <- "Kilometers"
names(RAW_DF)[names(RAW_DF) == "Selling.Price"] <- "Price"


# ИНИЦИЈАЛНА ОБРАБОТКА: ОТСТРАНУВАЊЕ НА ЕКСТРЕМНИ ВРЕДНОСТИ
#Пресметка на првиот и третиот квартал, како и интеркварталниот распон за
#вредностите во колоните 'Kilometers' и 'Price'
init_Q1_k <- quantile(RAW_DF$Kilometers, .25)
init_Q3_k <- quantile(RAW_DF$Kilometers, .75)
init_IQR_k <- IQR(RAW_DF$Kilometers)

init_Q1_p <- quantile(RAW_DF$Price, .25)
init_Q3_p <- quantile(RAW_DF$Price, .75)
init_IQR_p <- IQR(RAW_DF$Price)

#Граници за одредување на екстреми
init_Q1_k - 1.5*init_IQR_k
init_Q3_k + 1.5*init_IQR_k

init_Q1_p - 1.5*init_IQR_p
init_Q3_p + 1.5*init_IQR_p

#Се задржуваат само единките кои имаат вредност во опсегот
# (Q1 − 1.5*IQR, Q3 + 1.5*IQR) според двете обележја
CARS <- subset(RAW_DF,
               RAW_DF$Kilometers > (init_Q1_k - 1.5*init_IQR_k)
               & RAW_DF$Kilometers < (init_Q3_k + 1.5*init_IQR_k)
               & RAW_DF$Price > (init_Q1_p - 1.5*init_IQR_p)
               & RAW_DF$Price < (init_Q3_p + 1.5*init_IQR_p)
              )

#Димензија (број на редови, број на колони) на иницијалното податочно множество
dim(RAW_DF)

#Димензија (број на редови, број на колони) на филтрираното податочно множество
dim(CARS)


# A. ПРВ ДЕЛ
# ЗАДАЧА БР. 1
#Изработка на табела за распределба на честоти 

#Средување на колоните (поделени со 1000 за подобра визуелизација)
CARS$Kilometers1 = round(CARS$Kilometers/1000,0)
CARS$Price1 = round(CARS$Price/1000,0)

#Сортирани колони за подоцнежна употреба
sorted_Kilometers1 = sort(CARS$Kilometers1)
sorted_Price1 = sort(CARS$Price1)

#Пресметка на број на податоци во колона Kilometers1
n = length(CARS[,'Kilometers1'])

#Пресметка на опсег
R1 = range(CARS$Kilometers1)
R2 = range(CARS$Price1)

#Пресметка на број на интервали
k = round(1+3.322*(log10(n)),0)

#Определување на ширина на интервал
w1 = ceiling(((R1[2]-R1[1])/k))
w2 = ceiling(((R2[2]-R2[1])/k))

#Креирање на инервали
breaks1 = seq(R1[1], R1[1]+k*w1, by = w1)
i1 = cut(CARS$Kilometers1, breaks1, right = FALSE)
Честоти1 = table(i1)

breaks2 = seq(R2[1], R2[1]+k*w2, by = w2)
i2 = cut(CARS$Price1, breaks2, right = FALSE)
Честоти2 = table(i2)

#Креирање на вектор за средни точки
Средни_точки1 = c()
for (i in 1:k){
  new_elements1 = R1[1] + i*w1 - w1/2
  Средни_точки1 = c(Средни_точки1, new_elements1)
}

Средни_точки2 = c()
for (i in 1:k){
  new_elements2 = R2[1] + i*w2 - w2/2
  Средни_точки2 = c(Средни_точки2, new_elements2)
}

#Креирање на табела за распределба на честоти
Релативни_честоти1 = round(Честоти1/n, digits = 4)
Кумулативни_честоти1 = cumsum(Честоти1)
TABLE1 = as.data.frame(cbind(Средни_точки1, Честоти1, Релативни_честоти1, Кумулативни_честоти1))

Релативни_честоти2 = round(Честоти2/n, digits = 4)
Кумулативни_честоти2 = cumsum(Честоти2)
TABLE2 = as.data.frame(cbind(Средни_точки2, Честоти2, Релативни_честоти2, Кумулативни_честоти2))

#Приказ на податоците во хистограм
hist(CARS$Kilometers1, 
     main = 'Честота на поминати километри',
     xlab = "Поминати километри (во илјади)", 
     ylab = "Честота",
     border = "black", 
     col = "salmon", 
     xlim = c(0,R1[1]+k*w1),
     ylim = c(0,max(TABLE1$Честоти1)),
     breaks = breaks1,
     right = FALSE,
     labels = TRUE
    )

hist(CARS$Price1,
     main = 'Честота на цена',
     xlab = "Цена (во илјади)",
     ylab = "Честота",
     border = "black",
     col = "skyblue",
     xlim = c(0,R2[1]+k*w2),
     ylim = c(0,max(TABLE2$Честоти2)),
     breaks = breaks2,
     right = FALSE,
     labels = TRUE
    )

#Приказ на податоците во полигон
plot(TABLE1$Честоти1, 
     type = "b", 
     col = "salmon",
     xlab = "Поминати километри (во илјади)", 
     ylab = "Честота", 
     main = "Честота на поминати километри"
     )

plot(TABLE2$Честоти2, 
     type = "b", 
     col = "blue",
     xlab = "Цена (во илјади)", 
     ylab = "Честота", 
     main = "Честота на цена"
     )

plot(TABLE1$Кумулативни_честоти1,
     type = "b", 
     col = "Salmon",
     xlab = "Поминати километри (во илјади)", 
     ylab = "Кумулативна честота", 
     main = "Кумулативна честота на поминати километри"
     ) 

plot(TABLE2$Кумулативни_честоти2,
     type = "b", 
     col = "blue",
     xlab = "Цена (во илјади)", 
     ylab = "Кумулативна честота", 
     main = "Кумулативна честота на цена"
     ) 


# ЗАДАЧА БР. 2
#Конструирање на стебло - лист дијаграм

library(data.table)

#leftDigits - позиција на '|' во однос на децималната точка; rounding - бр. на децимали;
myStem <- function(x, leftDigits, rounding = 1){
  data = data.table("x" = x)
  data[, left := floor(x/10^leftDigits)]
  data[, right := (round(x - left*10^leftDigits, rounding))*10^rounding]
  data = data[, paste(sort(right), collapse = ""), by = left]
  data[, out := paste(left, " | ", V1), by = left]
  cat(data$out, sep = "\n")
}

myStem(sorted_Kilometers1, 1, 0)
myStem(sorted_Price1, 1, 0)


# ЗАДАЧА БР. 3
#Графика за расејување на податоците

library(ggplot2)

plot(
  x=CARS$Kilometers1,
  y=CARS$Price1,
  xlab = "Поминати километри",
  ylab = "Цена",
  main = 'Цена во однос на поминати километри',
  col = "salmon"
)


# ЗАДАЧА БР. 4
#Определување на мода, медијана и просек

ПРОСЕК1 = mean(CARS$Kilometers1)
ПРОСЕК2 = mean(CARS$Price1)

МЕДИЈАНА1 = median(CARS$Kilometers1)
МЕДИЈАНА2 = median(CARS$Price1)

#Креирање формула за мода
getmode = function(x){
  uniqv = unique(x)
  uniqv[which.max(tabulate(match(x, uniqv)))]
}

МОДА1 = getmode(CARS$Kilometers1)
МОДА2 = getmode(CARS$Price1)


# ЗАДАЧА БР. 5
#Определување на квартали, опсег и интерквартален распон

Q1_Километри = quantile(CARS$Kilometers1, .25)
Q2_Километри = МЕДИЈАНА1
Q3_Километри = quantile(CARS$Kilometers1, .75)

Q1_Цена = quantile(CARS$Price1, .25)
Q2_Цена = МЕДИЈАНА2
Q3_Цена = quantile(CARS$Price1, .75)

Опсег1 = R1[2] - R1[1]
Опсег2 = R2[2] - R2[1]

Интерквартален_распон1 = IQR(CARS$Kilometers1)
Интерквартален_распон2 = IQR(CARS$Price1)


# ЗАДАЧА БР. 6
#Определување на дисперзија и стандардна девијација

Дисперзија1 = var(CARS$Kilometers1)
Дисперзија2 = var(CARS$Price1)

Стандардна_девијација1 = sd(CARS$Kilometers1)
Стандардна_девијација2 = sd(CARS$Price1)

# ЗАДАЧА БР. 7
#Определување на коефициент на корелација

Коефициент_на_корелација = cor(CARS$Price1, CARS$Kilometers1)


# Б. ВТОР ДЕЛ 
# ЗАДАЧА БР. 1

#Определување интервал на доверба за математичко очекување

library(distributions3)

Стандардна_грешка = Стандардна_девијација1/sqrt(n)
Z=Normal(0,1)
alpha = 0.05
z = quantile(Z, 1-alpha/2)
Долна_граница = ПРОСЕК1 - z * Стандардна_грешка
Горна_граница = ПРОСЕК1 + z * Стандардна_грешка

#Се добива дека интервалот на доверба за математичкото очекување е (58,02601; 60,99760)


# ЗАДАЧА БР. 2
#Тестирање хипотези за математичко очекување
#Нулта хипотеза: Математичкото очекување е еднакво на 62 (илјади километри)
#Алтернативна хипотеза: Математичкото очекување не е еднакво на 62 (илјади километри)

library(BSDA)

z.test(x=CARS$Kilometers1, mu = 62, alternative = "two.sided", sigma.x = Стандардна_девијација1)
#Преку овој тест се добива, дека вредноста на p е помала од 0.05, поради што ја отфрламе нултата хипотеза

#Критичниот домен е 𝐶 = (−∞; −1,95996) ∪ (1,95996; +∞)
#Вредноста на тест-статистиката е Z0 = −3.2823 и припаѓа на критичниот домен
#Нултата хипотеза се отфрла


# ЗАДАЧА БР. 3
#Тест за распределба

shapiro.test(CARS$Kilometers1)
#Нултата хипотеза на Shapiro тест е дека податоците имаат нормална распределба. 
#Соодветно, алтернативната хипотеза е дека податоците немаат нормална распределба
#Во нашиот пример, бидејќи p < 0.05, нултата хипотеза се отфрла и заклучуваме дека податоците не се нормално распределени. 


# ЗАДАЧА БР. 4
#Тестирање на хипотези за независност
#Нулта хипотеза: Обележјата сопственик и тип на гориво се независни
#Алтернативна хипотеза: Обележјата сопственик и тип на гориво не се независни

library(pivottabler)

NF1 = CARS[, c('Owner', 'Fuel.Type')]

pt2 = PivotTable$new()
pt2$addData(NF1)
pt2$addColumnDataGroups('Fuel.Type')
pt2$addRowDataGroups('Owner')
pt2$defineCalculation(calculationName = "TotalCount", summariseExpression = "n()")
pt2$evaluatePivot()

PT1 = pt2$asDataFrame()
PT1[is.na(PT1)]=0

chisq.test(PT1)

степен_на_слобода = (length(unique(CARS$Owner))-1) * (length(unique(CARS$Fuel.Type))-1)
qchisq(p=0.05, df=степен_на_слобода, lower.tail=FALSE)

#Преку овој Пирсонов (Xи квадрат) тест, се добива x2 = 19.492, а критичниот домен започнува од 12.59159. 
#Сe заклучува дека нултата хипотеза се отфрла, т.е. обележјата сопственик и тип на гориво не се независни. 


# ЗАДАЧА БР. 5
#Регресиона анализа

#Според претходно направениот график на расејување, претпоставуваме дека помеѓу обележјата километри и цена не постои поврзаност. 
#За поддржување на таа претпоставка, го одредуваме коефициентот на корелација

cor.test(CARS$Kilometers1,CARS$Price1)
#Поради тоа што вредноста на коефициентот на корелација за овој примерок е -0.2326531, т.е. е поблиску до 0 отколку -1, станува збор за послаба негативна линеарна поврзаност. 

#Одредување на параметрите на модел на линеарна регресија
LR_model <- lm(CARS$Price1 ~ CARS$Kilometers1, data=CARS)
LR_model

#Со помош на оваа функција се добива дека:
# 1. пресекот со y-оската (ß0) е еднаков на 445.469
# 2. коефициентот на правец (ß1) е еднаков на -1.065
